vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC55S16_DFP.pdsc
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.iap1, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.iap1, device=LPC55S16.internal_condition">
      <require condition="anyOf.driver.iap1.internal_condition"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.iap1.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="iap1"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=LPC55S16.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=LPC55S16.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.pwm_ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=LPC55S16.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.rt_gpio_adapter.condition_id">
      <require condition="allOf.driver.lpc_gpio, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_gpio, device=LPC55S16.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=LPC55S16.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi, device=LPC55S16.internal_condition">
      <require condition="anyOf.allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition">
      <accept condition="allOf.component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition"/>
    </condition>
    <condition id="allOf.component.flexcomm_spi_adapter, driver.flexcomm_spi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_usart, component.usart_adapter, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_usart, component.usart_adapter, device=LPC55S16.internal_condition">
      <require condition="anyOf.driver.flexcomm_usart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.flexcomm_usart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
