vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC55S16_DFP.pdsc
    <condition id="driver.fro_calib.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=LPC55S16.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.gint.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.hashcrypt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.iap1.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=LPC55S16.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iocon.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lpc_rtc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.mcan.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.pca9420.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC55S16.internal_condition">
      <require condition="anyOf.driver.flexcomm_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.pca9422.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC55S16.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=LPC55S16.internal_condition"/>
    </condition>
